In [73]:
# Assignment 2A - Pandas Basics
# Lanke Gauri Arvind
# Roll No: 151

In [74]:
#import pandas
import pandas as pd

In [75]:
#creating series
s=pd.Series([20,40,60,80,100],index=['a','b','c','d','e'])
print("Series data:")
print(s)
print("Access single element:",s['d']) #accessing single element

Series data:
a     20
b     40
c     60
d     80
e    100
dtype: int64
Access single element: 80

In [76]:
type(s) # to check the type of s

pandas.core.series.Series

In [77]:
#creating dataframe
data=pd.DataFrame({
    'Employee':['Gauri','Payal','Shreyas','Urvi','Parth'],
    'Age':[21,22,23,21,22],
    'Salary':[50000,60000,55000,52000,58000],
    'Location':['Kopargaon','Mumbai','Kopargaon','Pohegaon','Shirdi']
})
df1=pd.DataFrame(data)
print("Dataframe data:")
print(df1)
print("\nAccess single column:\n",df1['Employee']) #accessing single column

Dataframe data:
  Employee  Age  Salary   Location
0    Gauri   21   50000  Kopargaon
1    Payal   22   60000     Mumbai
2  Shreyas   23   55000  Kopargaon
3     Urvi   21   52000   Pohegaon
4    Parth   22   58000     Shirdi

Access single column:
 0      Gauri
1      Payal
2    Shreyas
3       Urvi
4      Parth
Name: Employee, dtype: object

In [78]:
type(df1) # to check the type of df

pandas.core.frame.DataFrame

In [93]:
#load dataset
df=pd.read_csv('restaurant_sales.csv',header=0)
df.info() # to get info about dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 254 entries, 0 to 253
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Order ID        254 non-null    int64
 1   Date            254 non-null    object
 2   Product         254 non-null    object
 3   Price           254 non-null    float64
 4   Quantity        254 non-null    float64
 5   Purchase Type   254 non-null    object
 6   Payment Method  254 non-null    object
 7   Manager         254 non-null    object
 8   City            254 non-null    object
dtypes: float64(2), int64(1), object(6)
memory usage: 18.0+ KB

In [94]:
df.head() # to print first 5 rows of dataframe

,Order ID,Date,Product,Price,Quantity,Purchase Type,Payment Method,Manager,City
0,10452,07-11-2022,Fries,3.49,573.07,Online,Gift Card,Tom Jackson,London
1,10453,07-11-2022,Beverages,2.95,745.76,Online,Gift Card,Pablo Perez,Madrid
2,10454,07-11-2022,Sides & Other,4.99,200.40,In-store,Gift Card,Joao Silva,Lisbon
3,10455,08-11-2022,Burgers,12.99,569.67,In-store,Credit Card,Walter Muller,Berlin
4,10456,08-11-2022,Chicken Sandwiches,9.95,201.01,In-store,Credit Card,Walter Muller,Berlin

In [95]:
df.tail() # to print last 5 rows of dataframe

,Order ID,Date,Product,Price,Quantity,Purchase Type,Payment Method,Manager,City
249,10709,28-12-2022,Sides & Other,4.99,200.40,Drive-thru,Gift Card,Walter Muller,Berlin
250,10710,29-12-2022,Burgers,12.99,754.43,Drive-thru,Gift Card,Walter Muller,Berlin
251,10711,29-12-2022,Chicken Sandwiches,9.95,281.41,Drive-thru,Gift Card,Walter Muller,Berlin
252,10712,29-12-2022,Fries,3.49,630.37,Drive-thru,Gift Card,Walter Muller,Berlin
253,10713,29-12-2022,Beverages,2.95,677.97,Drive-thru,Gift Card,Walter Muller,Berlin

In [96]:
df.describe() # to get statistical summary of dataframe

           Order ID       Price    Quantity
count    254.000000  254.000000  254.000000
mean   10584.133858    7.102323  460.611457
std       75.889181    4.341855  214.888699
min    10452.000000    2.950000  200.400000
25%    10520.250000    3.490000  201.010000
50%    10583.500000    4.990000  538.880000
75%    10649.750000    9.950000  677.440000
max    10713.000000   29.050000  754.430000

In [97]:
df.shape # number of rows and columns

(254, 9)

In [98]:
df.dtypes # data types of each column

Order ID            int64
Date               object
Product            object
Price             float64
Quantity          float64
Purchase Type      object
Payment Method     object
Manager            object
City               object
dtype: object

In [99]:
df.index # index of dataframe

RangeIndex(start=0, stop=254, step=1)

In [100]:
df.columns # column names of dataframe

Index(['Order ID', 'Date', 'Product', 'Price', 'Quantity', 'Purchase Type',
       'Payment Method', 'Manager', 'City'],
      dtype='object')

In [101]:
df.isnull().sum() # check for null values

Order ID          0
Date              0
Product           0
Price             0
Quantity          0
Purchase Type     0
Payment Method    0
Manager           0
City              0
dtype: int64

In [102]:
df.nunique() # number of unique values in each column

Order ID          254
Date               53
Product             5
Price               7
Quantity           29
Purchase Type       3
Payment Method      3
Manager            14
City                5
dtype: int64

In [103]:
# to save dataframe to a new csv file
df.to_csv('new_restaurant_sales.csv',index=False)

In [104]:
#Arithmetic Operations on Series
print("Original Series:")
print(s)
print("\nMultiply by 3: ")
print(s*3)
print("\nAdd 10: ")   
print(s+10)

Original Series:
a     20
b     40
c     60
d     80
e    100
dtype: int64

Multiply by 3:
a     60
b    120
c    180
d    240
e    300
dtype: int64

Add 10:
a     30
b     50
c     70
d     90
e    110
dtype: int64

In [107]:
#Opeartions on DataFrame
print(df["City"]) # to access single column
print("\n",df[["Manager","City"]]) # to access multiple columns

0      London
1      Madrid
2      Lisbon
3      Berlin
4      Berlin
        ...
249    Berlin
250    Berlin
251    Berlin
252    Berlin
253    Berlin
Name: City, Length: 254, dtype: object

                 Manager    City
0      Tom      Jackson  London
1           Pablo Perez  Madrid
2         Joao    Silva  Lisbon
3         Walter Muller  Berlin
4         Walter Muller  Berlin
..                  ...     ...
249       Walter Muller  Berlin
250       Walter Muller  Berlin
251       Walter Muller  Berlin
252       Walter Muller  Berlin
253       Walter Muller  Berlin

[254 rows x 2 columns]

In [108]:
print(df.iloc[2]) # to access single row by index
print("\n",df.iloc[1:4]) # to access multiple rows by index

Order ID                  10454
Date                 07-11-2022
Product           Sides & Other
Price                      4.99
Quantity                  200.4
Purchase Type         In-store
Payment Method        Gift Card
Manager           Joao    Silva
City                     Lisbon
Name: 2, dtype: object

    Order ID        Date        Product  Price  Quantity Purchase Type  \
1     10453  07-11-2022      Beverages   2.95    745.76       Online
2     10454  07-11-2022  Sides & Other   4.99    200.40     In-store
3     10455  08-11-2022        Burgers  12.99    569.67     In-store

  Payment Method             Manager    City
1      Gift Card         Pablo Perez  Madrid
2      Gift Card       Joao    Silva  Lisbon
3    Credit Card       Walter Muller  Berlin

In [109]:
df.loc[df["Price"] > 20] # to filter rows based on condition

,Order ID,Date,Product,Price,Quantity,Purchase Type,Payment Method,Manager,City
28,10482,13-11-2022,Fries,25.50,630.37,In-store,Credit Card,Joao Silva,Lisbon
29,10486,14-11-2022,Chicken Sandwiches,29.05,201.01,In-store,Credit Card,Joao Silva,Lisbon

In [110]:
df.loc[df['City']=='London'] # to access rows based on condition

,Order ID,Date,Product,Price,Quantity,Purchase Type,Payment Method,Manager,City
0,10452,07-11-2022,Fries,3.49,573.07,Online,Gift Card,Tom Jackson,London
81,10541,25-11-2022,Chicken Sandwiches,9.95,201.01,Drive-thru,Credit Card,Tom Jackson,London
82,10542,25-11-2022,Fries,3.49,630.37,Drive-thru,Credit Card,Tom Jackson,London
83,10543,25-11-2022,Beverages,2.95,745.76,Drive-thru,Credit Card,Tom Jackson,London
84,10544,25-11-2022,Sides & Other,4.99,200.40,Drive-thru,Credit Card,Tom Jackson,London
...,...,...,...,...,...,...,...,...,...
163,10623,11-12-2022,Beverages,2.95,745.76,Online,Gift Card,Tom Jackson,London
164,10624,11-12-2022,Sides & Other,4.99,200.40,Online,Gift Card,Tom Jackson,London
165,10625,12-12-2022,Burgers,12.99,569.67,Online,Gift Card,Tom Jackson,London
166,10626,12-12-2022,Chicken Sandwiches,9.95,201.01,Online,Gift Card,Tom Jackson,London
167,10627,12-12-2022,Fries,3.49,630.37,Online,Gift Card,Tom Jackson,London

In [111]:
print(df.describe()) # to get statistical summary of dataframe
print("\nMean:",df["Price"].mean()) # to get mean of Price column
print("\nMedian:",df["Price"].median()) # to get median of Price column
print("\nMax Price:",df["Price"].max())  # to get max of Price column 
print("\nMin Price:",df["Price"].min())  # to get min of Price column
print("\nSum of Price:",df["Price"].sum())  # to get sum of Price column    
print("\nCount of Price:",df["Price"].value_counts())  # to get count of unique values in Price column

           Order ID       Price    Quantity
count    254.000000  254.000000  254.000000
mean   10584.133858    7.102323  460.611457
std       75.889181    4.341855  214.888699
min    10452.000000    2.950000  200.400000
25%    10520.250000    3.490000  201.010000
50%    10583.500000    4.990000  538.880000
75%    10649.750000    9.950000  677.440000
max    10713.000000   29.050000  754.430000

Mean: 7.102322834645669

Median: 4.99

Max Price: 29.05

Min Price: 2.95

Sum of Price: 1803.99

Count of Price: Price
12.99    52
9.95     51
3.49     50
2.95     50
4.99     49
25.50     1
29.05     1
Name: count, dtype: int64